#+property: header-args:python :session region-loss :async yes :exports none

#+begin_src python
  import pandas as pd
  import torch
  import math
  from torch import nn
#+end_src


**** 予測できた値の処理
     アルゴリズム用の変数
     #+begin_src python
       training = False                # ?
       output = preds[0]
       nB = output.data.size(0)
       nA = num_anchors
       nC = num_classes
       nH = output.data.size(2)
       nW = output.data.size(3)
       nPixels = nH * nW
       device = torch.device("cpu")

       # XXX: なにこれ?
       if seen is not None:
           # seen = torch.tensor(seen)
           seen = seen.clone().detach()
       elif training:
           seen += nB
       print("output shape:", output.shape)
     #+end_src

     #+RESULTS:
     : output shape: torch.Size([2, 24, 13, 13])


     Yolo の結果から, x.sigmoid, y.sigmoid, w, h, conf, cls を抽出.
     =output= から, 以下を作り出す.
     - =coord= → nB, nA, coordinates[x.sigmoid, y.sigmoid, w, h], nPixels
     - =conf= → nB, nA, nPixels[obj_score]
     - =cls= → nB * nA * nPixels, nC
     #+begin_src python
       # Output
       output = output.view(nB, nA, -1, nPixels)
       print(f"output shape:", output.shape)

       # coord
       coord = torch.zeros_like(output[:, :, :4])
       print("coord shape:", coord.shape)
       coord[:, :, :2] = output[:, :, :2].sigmoid()
       coord[:, :, 2:4] = output[:, :, 2:4]
       conf = output[:, :, 4].sigmoid()
       print("conf shape:", conf.shape)
       if nC > 1:
           cls = output[:, :, 5:].contiguous().view(nB * nA, nC, nPixels)
           print(f"1. cls shape {cls.shape}")
           # XXX: reshape のときに, 軸の値はどうやって影響を与えるか?
           cls = cls.transpose(1, 2).contiguous().view(-1, nC)
           print(f"2. cls shape {cls.shape}")
     #+end_src

     #+RESULTS:
     : output shape: torch.Size([2, 3, 8, 169])
     : coord shape: torch.Size([2, 3, 4, 169])
     : conf shape: torch.Size([2, 3, 169])
     : 1. cls shape torch.Size([6, 3, 169])
     : 2. cls shape torch.Size([1014, 3])


     =coord= を使って, 本当のボックスの値を格納する =pred_boxes= を作成.
     #+begin_src python
       # 行列は「cls」と同じ
       pred_boxes = torch.FloatTensor(nB * nA * nPixels, 4)
       print("pred_boxes shape:", pred_boxes.shape)

       # S ** 2 のようないグリッドを作成
       # ちなみに, これは行列ではなく, 画像の座標を作っている (x, y)
       lin_x = torch.linspace(0, nW - 1, nW).repeat(nH, 1).view(nPixels).to(device)
       lin_y = torch.linspace(0, nH - 1, nH).view(nH, 1).repeat(1, nW).view(nPixels).to(device)
       print("lin_x shape:", lin_x.shape)
       print("lin_y shape:", lin_y.shape)

       anchor_w = anchors[:, 0].contiguous().view(nA, 1).to(device)
       anchor_h = anchors[:, 1].contiguous().view(nA, 1).to(device)
       print("anchor_w shape:", anchor_w.shape)
       print("anchor_h shape:", anchor_h.shape)

       pred_boxes[:, 0] = (coord[:, :, 0].detach() + lin_x).view(-1)
       pred_boxes[:, 1] = (coord[:, :, 1].detach() + lin_y).view(-1)
       pred_boxes[:, 2] = (coord[:, :, 2].detach().exp() * anchor_w).view(-1)
       pred_boxes[:, 3] = (coord[:, :, 3].detach().exp() * anchor_h).view(-1)
       pred_boxes = pred_boxes.cpu()
     #+end_src

     #+RESULTS:
     : pred_boxes shape: torch.Size([1014, 4])
     : lin_x shape: torch.Size([169])
     : lin_y shape: torch.Size([169])
     : anchor_w shape: torch.Size([3, 1])
     : anchor_h shape: torch.Size([3, 1])

**** 真値を bb から抽出し, 処理
     パラメータ
     #+begin_src python :noweb yes
       def build_target_brambox(pred_boxes, ground_truth, nB, nH, nW):
           nA = num_anchors
           nAnchors = nA * nH * nW
           nPixels = nH * nW

           <<init-mask-for-loss-function>>
           <<init-gt-tensors>>
           <<what-is-this?>>
           <<set-_anchors>>

           # 画像ごとに
           for b, gt_filtered in ground_truth.groupby("batch_number", sort=False):
               <<make-gt-based-on-stride>>
               <<matched-conf-mask-to-zero>>
               <<best-anchor-for-each-gt>>
               <<masks-and-target-values-for-gt>>

           <<return>>



       coord_mask, conf_mask, cls_mask, tcoord, tconf, tcls = (
           build_target_brambox(pred_boxes, target, nB, nH, nW)
       )

       coord_mask = coord_mask.expand_as(tcoord).to(device).sqrt()
       tcoord = tcoord.to(device)
       conf_mask = conf_mask.to(device).sqrt()
       tconf = tconf.to(device)

       if nC > 1:
           tcls = tcls[cls_mask].view(-1).long().to(device)
           cls_mask = cls_mask.view(-1, 1).repeat(1, nC).to(device)
           _cls = cls[cls_mask].view(-1, nC)

       # 2つの物体が同じマスク座標とアンカーボックス座標をシェアするため, 1個足りない
       print("Number of detected gt:", tcls.numel())
     #+end_src

     #+RESULTS:
     : Number of detected gt: 4


